<?php

include('tcpdf.php');
include('../../includes/fpdi/fpdi.php');

/*echo json_encode($_REQUEST);
return;*/
// ******************************* _REQUEST ****************************************************//
$government = set_tis_620($_REQUEST['data'][0]); //ส่วนราชการ
$at         = set_tis_620($_REQUEST['data'][1]); //ที่
$date       = set_tis_620($_REQUEST['data'][2]); // วันที่
$subject    = set_tis_620($_REQUEST['data'][3]); // เรื่อง
$dear       = set_tis_620($_REQUEST['data'][4]); // เรียน
$rank       = set_tis_620($_REQUEST['data'][5]); // ยศ
$name       = set_tis_620($_REQUEST['data'][6]); // ชื่อ
$deputize   = set_tis_620($_REQUEST['data'][7]); // ตำแหน่งทำการแทน
$position   = set_tis_620($_REQUEST['data'][8]); // ตำแหน่ง


$contant = $_REQUEST['contant_html']; // เนื้อหา


// ******************************* _REQUEST ****************************************************//

// ******************************** เริ่มสร้างไฟล์ pdf  ******************************************//
$pdf = new FPDI(PDF_PAGE_ORIENTATION, PDF_UNIT, PDF_PAGE_FORMAT, true, 'UTF-8', false);  
// ******************************** เริ่มสร้างไฟล์ pdf  ******************************************//

// ******************************** กำหนดรายละเอียดของไฟล์ pdf **********************************//
$pdf->SetCreator(PDF_CREATOR);  
$pdf->SetAuthor('ninenik');  
$pdf->SetTitle('TCPDF table report');  
$pdf->SetSubject('TCPDF ทดสอบ');  
$pdf->SetKeywords('TCPDF, PDF, ทดสอบ,ninenik, guide'); 

// ******************************** กำหนดรายละเอียดของไฟล์ pdf **********************************//

// ******************************** กำหนดสี **********************************//
$pdf->setFooterData(  
    array(0,64,0),  // กำหนดสีของข้อความใน footer rgb   
    array(0,0,0)   // กำหนดสีของเส้นคั่นใน footer rgb   
);

// ******************************** กำหนดสี **********************************//

// *********** กำหนดฟอนท์ของ header และ footer  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php ******************//
//$pdf->setHeaderFont(Array(PDF_FONT_NAME_MAIN, '', PDF_FONT_SIZE_MAIN));  
//$pdf->setFooterFont(Array(PDF_FONT_NAME_DATA, '', PDF_FONT_SIZE_DATA));  
$pdf->setPrintHeader(false);
$pdf->setPrintFooter(false);
// *********** กำหนดฟอนท์ของ header และ footer  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php ******************//


// *********** กำหนดฟอนท์ของ monospaced  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//
$pdf->SetDefaultMonospacedFont(PDF_FONT_MONOSPACED);  
// *********** กำหนดฟอนท์ของ monospaced  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//

// *********** กำหนดขอบเขตความห่างจากขอบ  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//
$pdf->SetMargins(PDF_MARGIN_LEFT, PDF_MARGIN_TOP, PDF_MARGIN_RIGHT);  
$pdf->SetHeaderMargin(PDF_MARGIN_HEADER);  
$pdf->SetFooterMargin(PDF_MARGIN_FOOTER);
// *********** กำหนดขอบเขตความห่างจากขอบ  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//




// ********************************************** กำหนดแบ่่งหน้าอัตโนมัติ  ***************************************//
$pdf->SetAutoPageBreak(TRUE, PDF_MARGIN_BOTTOM);  
// ********************************************** กำหนดแบ่่งหน้าอัตโนมัติ  ***************************************//

// ********************************************** กำหนด ฟอนท์  **************************************************//
$pdf->SetFont('thsarabun', '', 16, '', true);  
// ********************************************** กำหนด ฟอนท์  **************************************************//
	



	// *********************************************** เพิ่มหน้า   ***********************************************//
	$pageCount = $pdf->setSourceFile('test.pdf');
	$tplIdx    = $pdf->importPage(1);

	$pdf->addPage();
	$pdf->useTemplate($tplIdx);  
	// *********************************************** เพิ่มหน้า   ***********************************************//

	// *********************************************** ส่วนราชการ ************************************************//
	$pdf->SetXY(55, 36);
	$pdf->Write(0, $government);
	// *********************************************** ส่วนราชการ ************************************************//

	// *************************************************** ที่ **************************************************//

	$pdf->SetXY(35, 42.4);
	$pdf->Write(0, $at);

	// *************************************************** ที่ **************************************************//

	// *************************************************** วันที่ ***********************************************//

	$pdf->SetXY(140, 42.4);
	$pdf->Write(0, $date);

	// *************************************************** วันที่ ***********************************************//

	// *************************************************** เรื่อง ************************************************//

	$pdf->SetXY(40, 48.9);
	$pdf->Write(0, $subject);

	// *************************************************** เรื่อง ************************************************//

	// *************************************************** เรียน ************************************************//
	$pdf->SetXY(40, 58.5);
	$pdf->Write(0, $dear);

	// *************************************************** เรียน ************************************************//
	$set_y_content_first = 68;

	$pdf -> setY($set_y_content_first);
	for ($i=0; $i <count($contant) ; $i++) { 
		

		// *********************************************** เนื้อหา 1 *********************************************//
		if($contant!=""){

			$html = '
			<span style="text-align:justify">'.(PARAGRAPH.(($contant[$i]))).'
			</span>';


			// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
			//echo htmlspecialchars($html,ENT_NOQUOTES);
			//echo "D-----------------------------------------------------------<br>";
			$pdf -> setY($pdf->gety());
			//echo $html;
			$pdf -> writeHTML($html, true, false, true, false, '');
			//$pdf->writeHTMLCell(100, 0, '', '', $html, 0, 0, 0, true, 'J');
		}
		// *********************************************** เนื้อหา 1 *********************************************//

	}

	

	// *********************************************** คำลงท้าย ************************************************//
	$set_y_postscript = ($pdf->gety() + 5);
	$pdf -> SetXY(110,$set_y_postscript);

	$pdf->Write(0, $rank);

	$html = '
	<span style="text-align:center">( '.$name.' )
	<br>
	'.$deputize.'
	<br>
	'.$position.'
	</span>';

	$pdf -> setXY(115,$pdf->gety()+5);
	$pdf->writeHTMLCell(50, 0, '', '', $html, 0, 0, 0, true, 'J');

	// *********************************************** คำลงท้าย ************************************************//

// แสดงไฟล์ pdf  
$pdf->Output('table_report.pdf', 'I');  



function set_tis_620($str){
	return $str;
	//return iconv('UTF-8', 'TIS-620', $str);
}
?>