<?php

include('tcpdf.php');
include('../../includes/fpdi/fpdi.php');


// ******************************* _REQUEST ****************************************************//
$government = 'ส่วนราชการ'; //ส่วนราชการ
$at         = 'ที่'; //ที่
$date       = 'วันที่'; // วันที่
$subject    = 'เรื่อง'; // เรื่อง
$dear       = 'เรียน'; // เรียน
$rank       = 'ยศ'; // ยศ
$name       = 'ชื่อ'; // ชื่อ
$position   = 'ตำแหน่ง'; // ตำแหน่ง
// ******************************* _REQUEST ****************************************************//

// ******************************** เริ่มสร้างไฟล์ pdf  ******************************************//
$pdf = new FPDI(PDF_PAGE_ORIENTATION, PDF_UNIT, PDF_PAGE_FORMAT, true, 'UTF-8', false);  
// ******************************** เริ่มสร้างไฟล์ pdf  ******************************************//

// ******************************** กำหนดรายละเอียดของไฟล์ pdf **********************************//
$pdf->SetCreator(PDF_CREATOR);  
$pdf->SetAuthor('ninenik');  
$pdf->SetTitle('TCPDF table report');  
$pdf->SetSubject('TCPDF ทดสอบ');  
$pdf->SetKeywords('TCPDF, PDF, ทดสอบ,ninenik, guide'); 

// ******************************** กำหนดรายละเอียดของไฟล์ pdf **********************************//

// ******************************** กำหนดสี **********************************//
$pdf->setFooterData(  
    array(0,64,0),  // กำหนดสีของข้อความใน footer rgb   
    array(0,0,0)   // กำหนดสีของเส้นคั่นใน footer rgb   
);

// ******************************** กำหนดสี **********************************//

// *********** กำหนดฟอนท์ของ header และ footer  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php ******************//
//$pdf->setHeaderFont(Array(PDF_FONT_NAME_MAIN, '', PDF_FONT_SIZE_MAIN));  
//$pdf->setFooterFont(Array(PDF_FONT_NAME_DATA, '', PDF_FONT_SIZE_DATA));  
$pdf->setPrintHeader(false);
$pdf->setPrintFooter(false);
// *********** กำหนดฟอนท์ของ header และ footer  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php ******************//


// *********** กำหนดฟอนท์ของ monospaced  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//
$pdf->SetDefaultMonospacedFont(PDF_FONT_MONOSPACED);  
// *********** กำหนดฟอนท์ของ monospaced  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//

// *********** กำหนดขอบเขตความห่างจากขอบ  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//
$pdf->SetMargins(PDF_MARGIN_LEFT, PDF_MARGIN_TOP, PDF_MARGIN_RIGHT);  
$pdf->SetHeaderMargin(PDF_MARGIN_HEADER);  
$pdf->SetFooterMargin(PDF_MARGIN_FOOTER);
// *********** กำหนดขอบเขตความห่างจากขอบ  กำหนดเพิ่มเติมในไฟล์  tcpdf_config.php   ******************//




// ********************************************** กำหนดแบ่่งหน้าอัตโนมัติ  ***************************************//
$pdf->SetAutoPageBreak(TRUE, PDF_MARGIN_BOTTOM);  
// ********************************************** กำหนดแบ่่งหน้าอัตโนมัติ  ***************************************//

// ********************************************** กำหนด ฟอนท์  **************************************************//
$pdf->SetFont('thsarabun', '', 16, '', true);  
// ********************************************** กำหนด ฟอนท์  **************************************************//
	



	// *********************************************** เพิ่มหน้า   ***********************************************//
	$pageCount = $pdf->setSourceFile('test.pdf');
	$tplIdx    = $pdf->importPage(1);

	$pdf->addPage();
	$pdf->useTemplate($tplIdx);  
	// *********************************************** เพิ่มหน้า   ***********************************************//

	// *********************************************** ส่วนราชการ ************************************************//
	$pdf->SetXY(55, 35.5);
	$pdf->Write(0, $government);
	// *********************************************** ส่วนราชการ ************************************************//

	// *************************************************** ที่ **************************************************//

	$pdf->SetXY(35, 41.8);
	$pdf->Write(0, $at);

	// *************************************************** ที่ **************************************************//

	// *************************************************** วันที่ ***********************************************//

	$pdf->SetXY(140, 41.8);
	$pdf->Write(0, $date);

	// *************************************************** วันที่ ***********************************************//

	// *************************************************** เรื่อง ************************************************//

	$pdf->SetXY(40, 48);
	$pdf->Write(0, $subject);

	// *************************************************** เรื่อง ************************************************//

	// *************************************************** เรียน ************************************************//
	$pdf->SetXY(40, 58.5);
	$pdf->Write(0, $dear);

	// *************************************************** เรียน ************************************************//

	// *********************************************** เนื้อหา 1 ************************************************//

	$set_y_content_first = 68;
	$html = '
	<span style="text-align:justify">'.PARAGRAPH.'ด้วย กอง ๗ ได้รับคำขอจาก ขว.ทบ. ตามหนังสือ ลับ ที่ กอง ๗ (โทร ๒๓๘๕) ลง กห ๐๓๑๐.๘ ให้ตรวจสอบประวัติและพฤติการณ์ของ นาย จตุพล ทำทอง กับบุคคลอื่น รวม ๑๐๐ คน เพื่อพิจารณา บรรจุเข้ารับราชการ
	</span>';

	// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
	$pdf -> setY($set_y_content_first);
	$pdf -> writeHTML($html, true, false, true, false, '');
	// *********************************************** เนื้อหา 1 ************************************************//


	// *********************************************** เนื้อหา 2 ************************************************//
	$html = '
	<span style="text-align:initial;">'.PARAGRAPH.'ด้วย กอง ๗ ได้รับคำขอจาก ขว.ทบ. ตามหนังสือ ลับ ที่ กอง ๗ (โทร ๒๓๘๕) ลง กห ๐๓๑๐.๘ ให้ตรวจสอบประวัติและพฤติการณ์ของ นาย จตุพล ทำทอง กับบุคคลอื่น รวม ๑๐๐ คน เพื่อพิจารณา บรรจุเข้ารับราชการ
	</span>';

	// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
	$pdf -> setY($pdf->gety());
	$pdf -> writeHTML($html, true, false, true, false, '');

	// *********************************************** เนื้อหา 2 ************************************************//

	// *********************************************** เนื้อหา 3 ************************************************//
	$html = '
	<span style="text-align:inherit">'.PARAGRAPH.'ด้วย กอง ๗ ได้รับคำขอจาก ขว.ทบ. ตามหนังสือ ลับ ที่ กอง ๗ (โทร ๒๓๘๕) ลง กห ๐๓๑๐.๘ ให้ตรวจสอบประวัติและพฤติการณ์ของ นาย จตุพล ทำทอง กับบุคคลอื่น รวม ๑๐๐ คน เพื่อพิจารณา บรรจุเข้ารับราชการ
	</span>';

	// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
	$pdf -> setY($pdf->gety());
	$pdf -> writeHTML($html, true, false, true, false, '');

	// *********************************************** เนื้อหา 3 ************************************************//


	// *********************************************** เนื้อหา 4 ************************************************//
	$html = '
	<span style="text-align:right">'.PARAGRAPH.'ด้วย กอง ๗ ได้รับคำขอจาก ขว.ทบ. ตามหนังสือ ลับ ที่ กอง ๗ (โทร ๒๓๘๕) ลง กห ๐๓๑๐.๘ ให้ตรวจสอบประวัติและพฤติการณ์ของ นาย จตุพล ทำทอง กับบุคคลอื่น รวม ๑๐๐ คน เพื่อพิจารณา บรรจุเข้ารับราชการ
	</span>';

	// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
	$pdf -> setY($pdf->gety());
	$pdf -> writeHTML($html, true, false, true, false, '');

	// *********************************************** เนื้อหา 4 ************************************************//



	// *********************************************** เนื้อหา 5 ************************************************//
	$html = '
	<span style="text-align:left">'.PARAGRAPH.'ด้วย กอง ๗ ได้รับคำขอจาก ขว.ทบ. ตามหนังสือ ลับ ที่ กอง ๗ (โทร ๒๓๘๕) ลง กห ๐๓๑๐.๘ ให้ตรวจสอบประวัติและพฤติการณ์ของ นาย จตุพล ทำทอง กับบุคคลอื่น รวม ๑๐๐ คน  เพื่อพิจารณา บรรจุเข้ารับราชการ
	</span>';

	// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
	$pdf -> setY($pdf->gety());
	$pdf -> writeHTML($html, true, false, true, false, '');

	// *********************************************** เนื้อหา 5 ************************************************//




	// *********************************************** คำลงท้าย ************************************************//
	$set_y_postscript = ($pdf->gety() + 5);
	$pdf -> SetXY(110,$set_y_postscript);

	$pdf->Write(0, $rank);
	// *********************************************** คำลงท้าย ************************************************//



	$html = '

	<span style="text-align:center">
	( '.$name.' )
	<br>
	'.$position.'
	<br>
	ผช.ผอ.กอง ๗
	</span>';

	// สร้าง pdf ด้วยคำสั่ง writeHTMLCell() 
	$pdf -> setY($pdf->gety()+10);
	$pdf -> writeHTML($html, true, false, true, false, ''); 



	// *********************************************** วงเว็บชื่อ ***********************************************//
	//$set_y_postscript = ($pdf->gety() + 10);
	//$pdf -> SetXY(125,$set_y_postscript);

	//$pdf->Write(0, '( มาลินี เสมาชัย )');
	// *********************************************** วงเว็บชื่อ ***********************************************//


	// *********************************************** ตำแหน่ง ************************************************//
	//$set_y_postscript = ($pdf->gety() + 5);
	//$pdf -> SetXY(119,$set_y_postscript);

	//$pdf->Write(0, 'ผช.ผอ.กอง ๗ ทำการแทน');
	// *********************************************** ตำแหน่ง ************************************************//

	// *********************************************** ตำแหน่ง 2 **********************************************//
	//$set_y_postscript = ($pdf->gety() + 5);
	//$pdf -> SetXY(130,$set_y_postscript);

	//$pdf->Write(0, 'ผช.ผอ.กอง ๗');
	// *********************************************** ตำแหน่ง 2 **********************************************//

// แสดงไฟล์ pdf  
$pdf->Output('table_report.pdf', 'I');  


?>